In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
new=pd.read_excel(r"C:\Users\SDR\Desktop\student.xlsx")
new

     Math  Reading  Writing
0      48       68       63
1      62       81       72
2      79       80       78
3      76       83       79
4      59       64       62
..    ...      ...      ...
995    72       74       70
996    73       86       90
997    89       87       94
998    83       82       78
999    66       66       72

[1000 rows x 3 columns]

In [3]:
new.shape

(1000, 3)

In [4]:
new.columns

Index(['Math', 'Reading', 'Writing'], dtype='object')

In [5]:
new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Math     1000 non-null   int64
 1   Reading  1000 non-null   int64
 2   Writing  1000 non-null   int64
dtypes: int64(3)
memory usage: 23.6 KB

In [6]:
new.describe()

              Math      Reading      Writing
count  1000.000000  1000.000000  1000.000000
mean     67.290000    69.872000    68.616000
std      15.085008    14.657027    15.241287
min      13.000000    19.000000    14.000000
25%      58.000000    60.750000    58.000000
50%      68.000000    70.000000    69.500000
75%      78.000000    81.000000    79.000000
max     100.000000   100.000000   100.000000

In [7]:
x=new.loc[0:10,(("Math"))]
x

0     48
1     62
2     79
3     76
4     59
5     69
6     70
7     46
8     61
9     86
10    62
Name: Math, dtype: int64

In [8]:
y=new.iloc[0:11,2:3]
y

    Writing
0        63
1        72
2        78
3        79
4        62
5        85
6        83
7        41
8        80
9        77
10       64

In [11]:
x.isna()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
Name: Math, dtype: bool

In [12]:
y.isna()

    Writing
0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False

In [13]:
x.count()

11

In [14]:
y.count()

Writing    11
dtype: int64